# merge()

In [ ]:
# what is pandas merge Funtion;
# pandas merge connects columns or indexes in dataFrame based on one or more keys

In [1]:
import pandas as pd

In [8]:
df1=pd.DataFrame({'ID':[1,2,3,4,],'class':[9,10,11,12]})
df1

   ID  class
0   1      9
1   2     10
2   3     11
3   4     12

In [9]:
df2=pd.DataFrame({'ID':[1,2,3,4,],'Name':['A','B','C','D']})
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

In [10]:
pd.merge(df1,df2,on='ID')  #foreign key needed
#below merged table

   ID  class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [11]:
pd.merge(df2,df1,on='ID')

   ID Name  class
0   1    A      9
1   2    B     10
2   3    C     11
3   4    D     12

In [12]:
#if any item haven't similar items it can't be merged(only that row)
#only common values will be merged

In [13]:
#how 
#---->inner
pd.merge(df1,df2,on='ID',how='inner')

   ID  class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [14]:
#---->left
pd.merge(df1,df2,on='ID',how='left')

   ID  class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [15]:
pd.merge(df1,df2,on='ID',how='outer')

   ID  class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [16]:
#indicator parameter
pd.merge(df1,df2,on='ID',indicator=True) 
#both means both data from different dataframe are available

   ID  class Name _merge
0   1      9    A   both
1   2     10    B   both
2   3     11    C   both
3   4     12    D   both

In [17]:
df1

   ID  class
0   1      9
1   2     10
2   3     11
3   4     12

In [18]:
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

In [19]:
df3=pd.DataFrame({'ID':[1,2,3,4],'class':[9,10,11,12]})
df3

   ID  class
0   1      9
1   2     10
2   3     11
3   4     12

In [23]:
df4=pd.DataFrame({'ID':[5,6,7,8],'Name':['A','B','C','D']})
df4

   ID Name
0   5    A
1   6    B
2   7    C
3   8    D

In [21]:
pd.merge(df3,df4)  #nothing will printing because nothing is common between them

Empty DataFrame
Columns: [ID, class]
Index: []

In [24]:
#lets use parameter leftindex and rightindex
pd.merge(df3,df4,left_index=True,right_index=True)

   ID_x  class  ID_y Name
0     1      9     5    A
1     2     10     6    B
2     3     11     7    C
3     4     12     8    D

In [ ]:
#if both dataFrame is same
df5=pd.DataFrame({'ID':[1,2,3,4,],'class':[9,10,11,12]})
df5

In [25]:
df6=pd.DataFrame({'ID':[1,2,3,4,],'class':[9,10,11,12]})
df6

   ID  class
0   1      9
1   2     10
2   3     11
3   4     12

In [26]:
pd.merge(df1,df2,on='ID',suffixes=('_Higher','_Middle'))

   ID  class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D